misc/holidays.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Holidays</title>
<!-- 2016-10-29 Sat 21:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Holidays</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">2016</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
| Occasion | Day       |       Date | Hours |
|----------+-----------+------------+-------|
|          | Monday    | 2016-02-01 |     8 |
|          | Friday    | 2016-03-18 |     7 |
|          | Thursday  | 2016-04-14 |     8 |
|          | Friday    | 2016-04-15 |     7 |
|          | Monday    | 2016-04-18 |     8 |
|          | Tuesday   | 2016-04-19 |     8 |
| bike     | Wednesday | 2016-05-18 |     8 |
| sweden   | Wednesday | 2016-06-08 |     8 |
| sweden   | Thursday  | 2016-06-09 |     8 |
| sweden   | Friday    | 2016-06-10 |     7 |
| sweden   | Monday    | 2016-06-13 |     8 |
| sweden   | Tuesday   | 2016-06-14 |     8 |
|          | Monday    | 2016-07-25 |     8 |
|          | Tuesday   | 2016-07-26 |     8 |
|          | Wednesday | 2016-07-27 |     8 |
|          | Thursday  | 2016-07-28 |     8 |
|          | Friday    | 2016-07-29 |     7 |
| clive    | Friday    | 2016-08-12 |     7 |
|          | Tuesday   | 2016-09-13 |     8 |
|          | Wednesday | 2016-09-14 |     8 |
|          | Thursday  | 2016-09-15 |     8 |
|          | Friday    | 2016-09-16 |     7 |
|          | Monday    | 2016-09-19 |     8 |
| test     | Wednesday | 2016-10-26 |     8 |
|          | Thursday  | 2016-10-27 |     8 |
|----------+-----------+------------+-------|
|          |           |            |   194 |
</pre>

<ul class="org-ul">
<li><b>Remaining</b> 78
</li>
<li>Allowance: 200
</li>
<li>Carry: 72
</li>
<li>Total: 272
</li>
<li><b>bank holidays</b>
</li>
<li><b>sundays</b>
<ul class="org-ul">
<li>2016-09-04
</li>
<li>2016-08-21
</li>
<li>2016-07-03
</li>
<li>2016-05-29
</li>
<li>2016-04-24
</li>
<li>2016-03-20
</li>
<li>2016-02-14
</li>
<li>2016-01-10
</li>
</ul>
</li>
<li><b>sick</b>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">2015</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
| Occasion  | Day       |       Date | Hours |
|-----------+-----------+------------+-------|
|           | Monday    | 2015-03-02 |     8 |
|           | Tuesday   | 2015-03-03 |     8 |
|           | Wednesday | 2015-03-04 |     8 |
|           | Thursday  | 2015-03-05 |     8 |
|           | Friday    | 2015-03-06 |     7 |
| clive     | Friday    | 2015-05-01 |     7 |
| frames    | Monday    | 2015-07-06 |     8 |
|           | Tuesday   | 2015-07-07 |     8 |
|           | Wednesday | 2015-07-08 |     8 |
|           | Monday    | 2015-08-17 |     8 |
|           | Tuesday   | 2015-08-18 |     8 |
|           | Wednesday | 2015-08-19 |     8 |
| dublin    | Monday    | 2015-09-21 |     8 |
|           | Monday    | 2015-09-28 |     8 |
|           | Tuesday   | 2015-09-29 |     8 |
|           | Wednesday | 2015-09-30 |     8 |
|           | Thursday  | 2015-10-01 |     8 |
|           | Friday    | 2015-10-02 |     7 |
| lisbon    | Friday    | 2015-10-16 |     7 |
| lisbon    | Monday    | 2015-10-19 |     8 |
| new york  | Thursday  | 2015-11-19 |     8 |
| new york  | Friday    | 2015-11-20 |     7 |
| new york  | Monday    | 2015-11-23 |     8 |
|           | Friday    | 2015-11-27 |     7 |
|           | Monday    | 2015-11-30 |     8 |
| christmas | Tuesday   | 2015-12-29 |     8 |
|-----------+-----------+------------+-------|
|           |           |            |   202 |
</pre>

<ul class="org-ul">
<li><b>Remaining</b> 72
</li>
<li>Allowance: 200
</li>
<li>Carry: 74
</li>
<li>Total: 274
</li>
<li><b>bank holidays</b>
<ul class="org-ul">
<li>-
</li>
</ul>
</li>
<li><b>sundays</b>
<ul class="org-ul">
<li>2015-12-06
</li>
<li>2015-10-25
</li>
<li>2015-09-13
</li>
<li>2015-08-02
</li>
<li>2015-06-21
</li>
<li>2015-05-10
</li>
<li>2015-03-29
</li>
<li>2015-02-15
</li>
<li>2015-01-04
</li>
</ul>
</li>
<li><b>sick</b>
<ul class="org-ul">
<li>2015-10-08
</li>
<li>2015-04-27
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">2014</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
| Occasion    | Day       |       Date | Hours |
|-------------+-----------+------------+-------|
| clive       | Thursday  | 2014-02-06 |     8 |
|             | Wednesday | 2014-04-30 |     8 |
|             | Thursday  | 2014-05-01 |     8 |
|             | Friday    | 2014-05-02 |     7 |
| arcade fire | Monday    | 2014-06-30 |     8 |
| seamus      | Tuesday   | 2014-07-01 |     8 |
| seamus      | Wednesday | 2014-07-02 |     8 |
| seamus      | Thursday  | 2014-07-03 |     8 |
| seamus      | Friday    | 2014-07-04 |     7 |
| bike        | Monday    | 2014-07-28 |     8 |
| bike        | Tuesday   | 2014-07-29 |     8 |
| bike        | Wednesday | 2014-07-30 |     8 |
| bike        | Thursday  | 2014-07-31 |     8 |
| bike        | Friday    | 2014-08-01 |     7 |
| break       | Monday    | 2014-09-29 |     8 |
| break       | Tuesday   | 2014-09-30 |     8 |
| break       | Wednesday | 2014-10-01 |     8 |
| break       | Thursday  | 2014-10-02 |     8 |
| break       | Friday    | 2014-10-03 |     7 |
| elaine      | Thursday  | 2014-10-16 |     8 |
| elaine      | Friday    | 2014-10-17 |     7 |
|             | Monday    | 2014-11-17 |     8 |
|             | Tuesday   | 2014-11-18 |     8 |
|             | Monday    | 2014-12-08 |     8 |
|             | Tuesday   | 2014-12-09 |     8 |
|             | Wednesday | 2014-12-31 |     8 |
|-------------+-----------+------------+-------|
|             |           |            |   203 |
</pre>

<ul class="org-ul">
<li><b>Remaining</b> 74 (~2 weeks)
</li>
<li>Allowance: 200
</li>
<li>Carry: 77
</li>
<li>Total: 277
</li>
<li><b>bank holidays</b>
<ul class="org-ul">
<li>-
</li>
</ul>
</li>
<li><b>sundays</b>
<ul class="org-ul">
<li>2014-11-23
</li>
<li>2014-10-12
</li>
<li>2014-08-31
</li>
<li>2014-07-20
</li>
<li>2014-04-27
</li>
<li>2014-03-09
</li>
<li>2014-02-09
</li>
</ul>
</li>
<li><b>sick</b>
<ul class="org-ul">
<li>-
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">2013</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
| Occasion  | Day         |       Date | Hours |
|-----------+-------------+------------+-------|
| Dublin    | Friday      | 2013-02-01 |     7 |
| drive     | Friday      | 2013-02-08 |     7 |
| week      | Wednesday   | 2013-02-13 |     8 |
| week      | Thursday    | 2013-02-14 |     8 |
| week      | Friday      | 2013-02-15 |     7 |
| week      | Monday      | 2013-02-18 |     8 |
| week      | Tuesday     | 2013-02-19 |     8 |
| test      | Wednesday   | 2013-03-06 |     8 |
| clive     | Friday      | 2013-06-07 |     7 |
| rosslare  | Friday (.5) | 2013-06-22 |     3 |
| sweden    | Thursday    | 2013-07-11 |     8 |
| sweden    | Friday      | 2013-07-12 |     7 |
| longitude | Friday      | 2013-07-19 |     7 |
| dublin    | Monday      | 2013-09-16 |     8 |
| dublin    | Tuesday     | 2013-09-17 |     8 |
| galway    | Friday      | 2013-09-27 |     7 |
| galway    | Monday      | 2013-09-30 |     8 |
| leitrim   | Friday      | 2013-10-25 |     7 |
| leitrim   | Monday      | 2013-10-28 |     0 |
| new york  | Thursday    | 2013-11-14 |     8 |
| new york  | Friday      | 2013-11-15 |     7 |
| new york  | Monday      | 2013-11-18 |     8 |
| new york  | Tuesday     | 2013-11-19 |     8 |
| dublin    | Monday      | 2013-11-25 |     8 |
| dublin    | Tuesday     | 2013-11-26 |     8 |
| dublin    | Wednesday   | 2013-11-27 |     8 |
| dublin    | Thursday    | 2013-11-28 |     8 |
| dublin    | Friday      | 2013-11-29 |     7 |
| dublin    | Friday      | 2013-12-20 |     7 |
| dublin    | Monday      | 2013-12-23 |     8 |
| dublin    | Tuesday     | 2013-12-31 |     8 |
|-----------+-------------+------------+-------|
|           |             |            |   224 |
</pre>

<ul class="org-ul">
<li>Allowance: 200
</li>
<li>Carry: 101
</li>
<li>Total: 301
</li>
<li>Unused: 77
</li>

<li><b>bank holidays</b>
<ul class="org-ul">
<li>-
</li>
</ul>
</li>
<li><b>sundays</b>
<ul class="org-ul">
<li>2013-12-15
</li>
<li>2013-11-03
</li>
<li>2013-09-22
</li>
<li>2013-08-11
</li>
<li>2013-06-30
</li>
<li>2013-05-19
</li>
<li>2013-04-07
</li>
<li>2013-03-03
</li>
<li>2013-01-13
</li>
</ul>
</li>
<li><b>sick</b>
<ul class="org-ul">
<li>2013-09-14
</li>
<li>2013-09-13
</li>
<li>2013-09-12
</li>
<li>2013-09-11
</li>
<li>2013-03-20
</li>
<li>2013-03-19
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">2012</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
| Occasion    | Day       |       Date | Hours |
|-------------+-----------+------------+-------|
| Dublin      | Wednesday | 2012-02-01 |     8 |
| Brussells   | Friday    | 2012-02-24 |     7 |
| Brussells   | Monday    | 2012-02-27 |     8 |
| Fermanagh   | Friday    | 2012-04-06 |     7 |
| Fermanagh   | Monday    | 2012-04-09 |     0 |
| Poland      | Monday    | 2012-06-11 |     8 |
| Poland      | Tuesday   | 2012-06-12 |     8 |
| Poland      | Wednesday | 2012-06-13 |     8 |
| Poland      | Thursday  | 2012-06-14 |     8 |
| Poland      | Friday    | 2012-06-15 |     7 |
| Poland      | Monday    | 2012-06-18 |     8 |
| Poland      | Tuesday   | 2012-06-19 |     8 |
| Poland      | Wednesday | 2012-06-20 |     8 |
| Bishopstown | Friday    | 2012-08-10 |     7 |
| Dublin      | Thursday  | 2012-09-13 |     8 |
| Dublin      | Friday    | 2012-09-14 |     7 |
| Dublin      | Monday    | 2012-11-19 |     8 |
| Dublin      | Tuesday   | 2012-11-20 |     8 |
| Dublin      | Wednesday | 2012-11-21 |     8 |
| Dublin      | Thursday  | 2012-11-22 |     8 |
| Dublin      | Friday    | 2012-11-23 |     7 |
| Christmas   | Monday    | 2012-12-24 |     8 |
| Christmas   | Friday    | 2012-12-28 |     3 |
| Christmas   | Monday    | 2012-12-31 |     8 |
|-------------+-----------+------------+-------|
|             |           |            |   173 |
</pre>


<ul class="org-ul">
<li><b>bank holidays</b>
<ul class="org-ul">
<li>2012-12-26
</li>
</ul>
</li>
<li><b>sundays</b>
<ul class="org-ul">
<li>2012-09-09
</li>
<li>2012-10-21
</li>
</ul>
</li>
<li><b>sick</b>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">2011</h2>
<div class="outline-text-2" id="text-6">
<pre class="example">
| Occasion        | Day       |       Date | Hours |
|-----------------+-----------+------------+-------|
| Adare           | Friday    | 2011-03-25 |     7 |
| Dublin          | Monday    | 2011-05-09 |     8 |
| Dublin          | Tuesday   | 2011-05-10 |     8 |
| Dublin          | Wednesday | 2011-05-11 |     8 |
| Dublin          | Thursday  | 2011-05-12 |     8 |
| Dublin          | Friday    | 2011-05-13 |     7 |
| Bishopstown     | Friday    | 2011-06-03 |     7 |
| driving test    | Tuesday   | 2011-06-14 |     4 |
| Roundstone      | Friday    | 2011-07-22 |     7 |
| Roundstone      | Monday    | 2011-07-25 |     8 |
| Powerscourt     | Friday    | 2011-08-12 |     7 |
| electric picnic | Friday    | 2011-09-02 |     7 |
| electric picnic | Monday    | 2011-09-05 |     8 |
| Amsterdam       | Friday    | 2011-10-07 |     7 |
| Amsterdam       | Monday    | 2011-10-10 |     8 |
|                 | Monday    | 2011-11-07 |     8 |
|                 | Wednesday | 2011-11-09 |     8 |
|                 | Thursday  | 2011-11-10 |     8 |
|                 | Thursday  | 2011-11-24 |     8 |
|                 | Friday    | 2011-11-25 |     7 |
|                 | Monday    | 2011-11-28 |     8 |
|-----------------+-----------+------------+-------|
|                 |           |            |   156 |
</pre>

<ul class="org-ul">
<li><b>bank holidays</b>
<ul class="org-ul">
<li>2011-10-31
</li>
<li>2011-12-26
</li>
</ul>
</li>
<li><b>sundays</b>
<ul class="org-ul">
<li>2011-01-30
</li>
<li>2011-03-13
</li>
<li>2011-06-19
</li>
<li>2011-07-31
</li>
<li>2011-09-18
</li>
<li>2011-11-06
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-10-29 Sat 21:53</p>
<p class="validation"></p>
</div>
</body>
</html>
